
&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	СохранитьНастройки();
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить()
	
	Соединение = Новый HTTPСоединение(Объект.Хост, Объект.Порт);
	
	ОбновитьТаблицуДанных(Соединение);
	ОбновитьДанныеСтраниц(Соединение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуДанных(Соединение = Неопределено)
	
	Если Соединение <> Неопределено Тогда
		Соединение = Новый HTTPСоединение(Объект.Хост, Объект.Порт);
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос("?query=" + ТекстЗапросаВыборки());
	
	Результат = Соединение.Получить(HTTPЗапрос);
		
	РезультатСтрокой = Результат.ПолучитьТелоКакСтроку();
	МассивСтрок = СтрРазделить(РезультатСтрокой, Символы.ПС, Ложь);
	
	ВывестиТабличныйДокумент(МассивСтрок);
	
	ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаТаблицаДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСтраниц(Соединение = Неопределено)
	
	Если Соединение <> Неопределено Тогда
		Соединение = Новый HTTPСоединение(Объект.Хост, Объект.Порт);
	КонецЕсли;
	
	//Соединение = Новый HTTPСоединение(Объект.Хост, Объект.Порт);
	HTTPЗапрос = Новый HTTPЗапрос("?query=" + ТекстЗапросаКоличестваСтрок());
	Результат = Соединение.Получить(HTTPЗапрос);
		
	РезультатСтрокой = Результат.ПолучитьТелоКакСтроку();
	
	ВсегоЗаписей = Число(РезультатСтрокой);
	ВсегоСтраниц = Цел(ВсегоЗаписей / РазмерСтраницы);
	Если ВсегоЗаписей % РазмерСтраницы > 0 Тогда
		ВсегоСтраниц = ВсегоСтраниц + 1;
	КонецЕсли;
	
КонецПроцедуры

#Область ВыводВТабличныйДокумент

&НаСервере
Процедура ВывестиТабличныйДокумент(МассивСтрок)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	ШапкаНомер = Макет.ПолучитьОбласть("Шапка|НомерСтроки");
	ШапкаДанных = Макет.ПолучитьОбласть("Шапка|Колонка");
	ЯчейкаНомер = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ЯчейкаДанных = Макет.ПолучитьОбласть("Строка|Колонка");
	
	
	ТаблицаДанных.Очистить();
	
	ШапкаНомер.Область("R1C1:R2C2").ШиринаКолонки = 5;
	ТаблицаДанных.Вывести(ШапкаНомер);
	Для Каждого НастройкаКолонки Из Объект.НастройкиКолонок Цикл
		Если НЕ НастройкаКолонки.Отображать Тогда
			Продолжить;
		КонецЕсли;
			
		ШапкаДанных.Параметры.Значение = НастройкаКолонки.Заголовок;
		ШапкаДанных.Область("R1C1:R2C2").ШиринаКолонки = НастройкаКолонки.Ширина;
		ТаблицаДанных.Присоединить(ШапкаДанных);
	КонецЦикла;
	
	Индекс = 1;
	Для Каждого СтрокаДанных Из МассивСтрок Цикл
		ЯчейкаДанных.Параметры.Значение = Индекс;
		ТаблицаДанных.Вывести(ЯчейкаДанных);
		
		МассивПолей = СтрРазделить(СтрокаДанных, Символы.Таб);
		Для Каждого ЗначениеПоля Из МассивПолей Цикл
			ЯчейкаДанных.Параметры.Значение = ЗначениеПоля;
			ТаблицаДанных.Присоединить(ЯчейкаДанных);
		КонецЦикла;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область КонструкторЗапросов

Функция ТекстЗапросаВыборки()
	
	ТекстЗапроса = "SELECT ";
	
	МассивКолонок = Новый Массив;
	
	Для Каждого НастройкаКолонки Из Объект.НастройкиКолонок Цикл
		Если НастройкаКолонки.Отображать Тогда
			МассивКолонок.Добавить(НастройкаКолонки.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКолонок.Количество() = 0 Тогда
		ВызватьИсключение "Должна быть выбрана минимум одна колонка!";
	КонецЕсли;
	
	Для А = 0 По МассивКолонок.Количество() - 2 Цикл
		ТекстЗапроса = ТекстЗапроса + МассивКолонок[А] + ", ";
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + МассивКолонок[МассивКолонок.Количество() - 1];
	
	ТекстЗапроса = ТекстЗапроса + " FROM " + Объект.ИмяБазы + "." + Объект.ИмяТаблицы;
	
	ТекстЗапроса = ТекстЗапроса + ПолучитьТекстОтбора();
	
	ТекстЗапроса = ТекстЗапроса + " ORDER BY timestamp LIMIT " + ПолучитьТекстСмещенияСтраницы();
	
	Сообщить(ТекстЗапроса);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстОтбора()
	
	ТекстЗапроса = "";	
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстЗапроса = ТекстЗапроса + " WHERE ";
		Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
			ТекстЗапроса = ТекстЗапроса + " timestamp >= toDateTime('" + Формат(Объект.НачалоПериода, "ДФ='yyyy-MM-dd HH:mm:ss'") + "')";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			ТекстЗапроса = ТекстЗапроса + " AND"
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			ТекстЗапроса = ТекстЗапроса + " timestamp <= toDateTime('" + Формат(Объект.КонецПериода, "ДФ='yyyy-MM-dd HH:mm:ss'") + "')";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстСмещенияСтраницы()
	
	ТекстСмещения = "";
	
	Смещение = (НомерСтраницы - 1) * РазмерСтраницы;
	
	Если Смещение <> 0 Тогда
		ТекстСмещения = "" + Формат(Смещение, "ЧГ=0") + ", ";
	КонецЕсли;
	
	ТекстСмещения = ТекстСмещения + Формат(РазмерСтраницы, "ЧГ=0");
	
	Возврат ТекстСмещения;
	
КонецФункции

Функция ТекстЗапросаКоличестваСтрок()
	
	ТекстЗапроса = "SELECT COUNT(*)";
	ТекстЗапроса = ТекстЗапроса + " FROM " + Объект.ИмяБазы + "." + Объект.ИмяТаблицы;
	ТекстЗапроса = ТекстЗапроса + ПолучитьТекстОтбора();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#Область ФункцииИПроцедурыФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Хост = "localhost";
	Объект.Порт = 8123;
	Объект.ИмяБазы = "reglog";
	Объект.ИмяТаблицы = "reglog_upp";
	
	НомерСтраницы = 1;
	ВсегоСтраниц = 1;
	РазмерСтраницы = 100;
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ИнициализироватьНастройкиКолонок();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
	
	ВосстановитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(КлючНастройки = Неопределено)
	
	КлючОбъекта = "Обработка.КлиентClickhouse";
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "НачалоПериода", Объект.НачалоПериода);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "КонецПериода", Объект.КонецПериода);
	
	ТЗ = Объект.НастройкиКолонок.Выгрузить(, "Имя,Заголовок,Ширина,Отображать");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "НастройкиКолонок", Новый ХранилищеЗначения(ТЗ));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	КлючОбъекта = "Обработка.КлиентClickhouse";
	
	Объект.НачалоПериода = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "НачалоПериода");
	Объект.КонецПериода = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "КонецПериода");
	
	ХранилищеЗначения = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "НастройкиКолонок");
	
	Если ЗначениеЗаполнено(ХранилищеЗначения) Тогда
		ТЗ = ХранилищеЗначения.Получить();
		ОбъектЗначение = РеквизитФормыВЗначение("Объект");
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			СтрокаТЧ = ОбъектЗначение.НастройкиКолонок.Найти(СтрокаТЗ.Имя, "Имя");
			Если ЗначениеЗаполнено(СтрокаТЧ) Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ, "Заголовок,Ширина,Отображать");
			КонецЕсли;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройки(Команда)
	
	ОчиститьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиНаСервере()
	
	КлючОбъекта = "Обработка.КлиентClickhouse";
	ХранилищеОбщихНастроек.Удалить(КлючОбъекта, Неопределено, Неопределено);
	
КонецПроцедуры

#Область Пагинация

&НаКлиенте
Процедура СтраницаВлево(Команда)
	
	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = НомерСтраницы - 1;
		Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВправо(Команда)
	
	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = НомерСтраницы + 1;
		Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПервая(Команда)
	
	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = 1;
		Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПоследняя(Команда)
	
	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = ВсегоСтраниц;
		Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЗаписейПриИзменении(Элемент)
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСтраницыПриИзменении(Элемент)
	
	Обновить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

